import pulp

# Создаем задачу линейного программирования
problem = pulp.LpProblem("Целочисленное_программирование", pulp.LpMinimize)

# Определяем переменные
s1 = pulp.LpVariable("s1", lowBound=0, cat="Integer")
s2 = pulp.LpVariable("s2", lowBound=0, cat="Integer")
s3 = pulp.LpVariable("s3", lowBound=0, cat="Integer")
s5 = pulp.LpVariable("s5", lowBound=0, cat="Integer")

# Определяем целевую функцию
problem += (
    -3 * s1
    - 12 * s3
    - 12 * s5
    + 12 * s1
    + 24 * s3
    + 24 * s5
    - 60
    + 18 * s1
    + 36 * s3
    + 36 * s5
    - 90
    + 24 * s3
    + 36 * s5
    - 60
    + 12 * s1
    + 60 * s3
    + 48 * s5
    - 120
    + 96 * s3
    + 132 * s5
    - 228
    + 60 * s3
    + 60 * s5
    - 120
    + 60
    - 60
    + 90
    - 90
    + 60
    - 60
    + 120
    - 120
    + 228
    - 228
    + 120
    - 120
    + 60
    - 60
    + 60
    + 90
    + 60
    + 120
    - 120
    + 228
    - 60
    - 60
    + 120
    - 60
    - 60
    + 60
    - 60
    + 240
    - 240
    + 240
    - 240
    + 240
    - 240
    + 120
    - 120
    + 120
    - 120
    - 120
    + 120
    + 60,
    "Целевая_функция",
)

# Ограничения
problem += s1 + s2 + s3 + s5 <= 10, "Ограничение_1"
problem += -3 * s1 - 12 * s3 - 12 * s5 >= -60, "Ограничение_L"
problem += 12 * s1 + 24 * s3 + 24 * s5 - 60 >= 0, "Ограничение_D1"
problem += 18 * s1 + 36 * s3 + 36 * s5 - 90 >= 0, "Ограничение_D2"
problem += 24 * s3 + 36 * s5 - 60 >= 0, "Ограничение_D3"
problem += 12 * s1 + 60 * s3 + 48 * s5 - 120 >= 0, "Ограничение_E1"
problem += 96 * s3 + 132 * s5 - 228 >= 0, "Ограничение_E2"
problem += 60 * s3 + 60 * s5 - 120 >= 0, "Ограничение_E3"
problem += 60 - 60 >= 0, "Ограничение_D1-1"
problem += 90 - 90 >= 0, "Ограничение_D2-1"
problem += 60 - 60 >= 0, "Ограничение_D3-1"
problem += 120 - 120 >= 0, "Ограничение_E1-1"
problem += 228 - 228 >= 0, "Ограничение_E1-2"
problem += 120 - 120 >= 0, "Ограничение_E1-3"
problem += 60 - 60 >= 0, "Ограничение_D1-2"
problem += 60 >= 0, "Ограничение_D1-3"
problem += 90 >= 0, "Ограничение_D2-3"
problem += 60 >= 0, "Ограничение_D3-3"
problem += 120 - 120 >= 0, "Ограничение_E1-3"
problem += 228 - 60 - 60 >= 0, "Ограничение_E2-3"
problem += 120 - 60 - 60 >= 0, "Ограничение_E3-3"
problem += 60 - 60 >= 0, "Ограничение_P1"
# problem += -60 >= 0, "Ограничение_M"   # Always False
problem += 240 - 240 >= 0, "Ограничение_B1"
problem += 240 - 240 >= 0, "Ограничение_B2"
problem += 240 - 240 >= 0, "Ограничение_B1-2"
problem += 240 - 240 >= 0, "Ограничение_B2-2"
problem += 120 - 120 >= 0, "Ограничение_N1"
problem += 120 - 120 >= 0, "Ограничение_N1-1"
problem += -120 + 120 >= 0, "Ограничение_N1-2"
problem += 60 >= 0, "Ограничение_S1"

# Решаем задачу
problem.solve()

# Выводим результаты
print(f"Статус: {pulp.LpStatus[problem.status]}")
for v in problem.variables():
    print(f"{v.name} = {v.varValue}")
print(f"Минимальное значение целевой функции = {pulp.value(problem.objective)}")
