//Найти сумму членов арифметической прогрессии: a, a+d, ... a+(n+1)d по данным значениям a, n, d
#include <stdio.h>
#include <math.h>

#define _USE_MATH_DEFINES

int main()
{
	double a, n, d;
    printf("a = ");                                                                            //printf = выводит значение на экран
    scanf("\n%lf", &a);                                                                        //scanf = предлагает пользователю ввести значение переменной
    printf("d = ");                                                                            //&a = ссылаться на переменную a
    scanf("\n%lf", &d);
    printf("n = ");
    scanf("\n%lf", &n); 
	printf("Arithmetic progression = %f\n", a*((2*n + (n-1)*d)/(2)));
    return 0;
}
